app/controllers/bookings_controller.rb

SELECT * FROM `bookings` WHERE (`bookings`.`house_id` = 2) ORDER BY created_at DESC LIMIT 1
INSERT INTO `bookings` (`check_in`, `created_at`, `check_out`, `updated_at`, `user_id`, `house_id`) VALUES('2012-07-23', '2012-07-23 09:26:38', '2012-07-23', '2012-07-23 09:26:38', 1, NULL)
UPDATE `users` SET `updated_at` = '2012-07-23 11:41:58', `last_request_at` = '2012-07-23 11:41:58' WHERE `id` = 1
---
	def create
		@booking = Booking.new(params[:booking])
		@boo = Booking.find_by_house_id(@booking.house_id)

		unless @boo.nil?
			validates_date @booking.check_in,
			:between => [@boo.check_in, @boo.check_out]
		end

		@booking.user_id = current_user.id
		if @booking.save

SELECT * FROM `bookings` WHERE (`bookings`.`id` = 17) ORDER BY created_at DESC
DELETE FROM `bookings` WHERE `id` = 17
---
		def destroy
		@booking = Booking.find(params[:id])
		redirect_to root_path unless current_user?(@booking.user)
    	@booking.destroy