app/controllers/display_controller.rb

SELECT * FROM `bookings` ORDER BY created_at DESC
---
  def home

  	@title = "Home"
  	@house = House.new
  	@feed_items = House.all
  	@bookers = Booking.all