app/controllers/houses_controller.rb

	def create
	  @house = current_user.houses.build(params[:house])

	  	if @house.save
---
INSERT INTO `houses` (`desc`, `created_at`, `r_type`, `booker_id`, `min_stay`, `city`, `user_id`, `status`, `address`, `rent`, `B_rooms`, `updated_at`) VALUES('house1', '2012-07-19 11:32:31', 6, NULL, 90, 'New York', 2, 6, 'skdhaksdhkjahsda\r\nashdgasjhdgasjgdha\r\naksgdakshgd', 5000, 4, '2012-07-19 11:32:31')

	def destroy
		@house = House.find(params[:id])
		redirect_to root_path unless current_user?(@house.user)
    	@house.destroy
---
DELETE FROM `houses` WHERE `id` = 3

 	def set_book
 		@house = House.find(params[:id])
 		@house.booker_id = current_user.id
 		current_user.booked_id = @house.id
 		if params[:n].to_i > @house.r_type
 			flash[:notice] = "higher number"
 		else
 		@house.r_type = @house.r_type - params[:n].to_i
 		if @house.update_attributes(params[:user])
---
UPDATE `houses` SET `booker_id` = 1, `updated_at` = '2012-07-19 11:59:03' WHERE `id` = 2
UPDATE `users` SET `updated_at` = '2012-07-19 11:56:41', `last_request_at` = '2012-07-19 11:56:41' WHERE `id` = 1