app/controllers/surveys_controller.rb

INSERT INTO `surveys` (`score`, `speed`, `comments`, `updated_at`, `happiness`, `behavior`, `user_id`, `created_at`) VALUES(NULL, 20, 'ahskjdgkasd', '2013-02-03 07:25:45', 10, 30, 3, '2013-02-03 07:25:45')
---
	def create
		@survey = Survey.new(params[:survey])
		@survey.user_id = current_user.id
		if @survey.save