app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `created_at`, `booked_id`, `name`, `persistence_token`, `last_login_at`, `current_login_at`, `crypted_password`, `password_salt`, `last_request_at`, `last_login_ip`, `login_count`, `current_login_ip`, `updated_at`) VALUES('prashanth@freshdesk.com', '2012-07-19 11:31:27', NULL, 'Prashanth Kumar', '2be6d2609a46c3109731139c2399ef46ef0f4e39a72331a5f924a5a7c2595ed78826cd7d38d6ec230eac2bae4b4aaba9d629ac1fbc57afc4a30109f8e3358ccc', NULL, '2012-07-19 11:31:27', '3ba78edc550642e04ff615c6f5b973f42829ee34ca5ed40d3d4046effc7d987fd1d5ee8756bdd875292756b834cb01bc970d582c049c55d7ae509a139b4230ce', 'VFIAVVxvUqVm7aX9yLv0', '2012-07-19 11:31:27', NULL, 1, '127.0.0.1', '2012-07-19 11:31:27')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `updated_at` = '2012-07-15 02:27:48', `login_count` = 4, `last_request_at` = '2012-07-15 02:27:48', `password_salt` = 'AD8AkBQi7OuedWkvvEs', `last_login_at` = '2012-07-15 02:22:15', `current_login_at` = '2012-07-15 02:27:48', `crypted_password` = '95c581c6d9bf2ad3e4ce1cfd66d5687b837c130408550b2743e342775934e1ca85c5359f4c754113337a6789fb1c33ed77a3e4910cfd419a0ec3f59abce946d8', `persistence_token` = 'ed3d545b57defb5f2ef53854eb2f84600a65afbbc52de7b1449dd3a4e1d7e9cd805c70aa0c9df17ec1ffda6d7b31d38b09585d3bd4f35f7f5f0fe7a600c073ac' WHERE `id` = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])